<!DOCTYPE html>
<html lang="ko">
<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>회원가입 동의</title>

    <?php include "../include/link.php" ?>

</head>
<body>
    <?php include "../include/header.php" ?>
    <!-- //header -->

    <main id="main">
        <section id="join_banner">
            <h2 class="blind">회원가입 페이지입니다.</h2>
            <div class="join_banner container">
                <div class="img">
                    <img src="../../html/assets/img/join_banner.svg" alt="배너이미지">
                </div>
                <h3>회원가입</h3>
            </div>
        </section>
        <!-- //join_banner -->

        <section id="joinAgree" class="container">
            <h2 class="blind">회원 가입</h2>
            <div class="agree__inner">
                <form action="adminJoin.php" name="join" method="post" onSubmit="return joinChecks()">
                    <fieldset>
                        <legend class="blind">회원가입</legend>
                        <div class="agree">
                            <h3 class="blind">호밍사이트 이용약관(필수)</h3>
                            <div class="check">
                                <input type="checkbox" name="agreeCheck1" id="agreeCheck1">
                                <label for="agreeCheck1">호밍 사이트 이용약관(필수)</label>
                            </div>
                            <div class="desc">
                                <ul>
                                    <li>제 1조(목적 등)</li>
                                    <li>① 호밍 사이트(http://www.homming.com) 이용자 약관(이하 ‘본 약관’ 이라 합니다.)은 이용자가 호밍에서 제공하는 인터넷 관련 서비스를 이용함에 있어 이용자와 호밍의 권리 · 의무 및 책임사항을 규정함을 목적으로 합니다. </li>
                                    <li>② 이용자가 되고자 하는 자가 호밍이 정한 소정의 절차를 거쳐서 ‘동의’ 단추를 누르면 본 약관에 동의하는 것으로 간주합니다. 본 약관에 정하는 이외의 이용자와 호밍의 권리, 의무 및 책임사항에 관해서는 전기통신사업법 기타 대한민국의 관련 법령과 상관습에 의합니다.
                                    </li>
                                    <li>제2조(이용자의 정의)</li>
                                    <li>‘이용자’ 란 호밍사이트에 접속하여 본 약관에 따라 회원으로 가입하여 호밍이 제공하는 서비스를 받는 자를 말합니다.</li>
                                    <li>제3조(회원 가입)</li>
                                    <li>① 이용자가 되고자 하는 자는 호밍이 정한 가입 양식에 따라 회원정보를 기입하고 ‘가입하기’ 단추를 누르는 방법으로 회원 가입을 신청합니다.</li>
                                    <li>② 호밍은 제1항과 같이 회원으로 가입할 것을 신청한 자가 다음 각 호에 해당하지 않는 한 신청한 자를 회원으로 등록합니다.</li>
                                    <li>1. 가입신청자가 본 약관 제6조 제3항에 의하여 이전에 회원자격을 상실한 적이 있는 경우. 다만 제6조 제3항에 의한 회원자격 상실 후 3년이 경과한 자로서 호밍의 회원재가입 승낙을 얻은 경우에는 예외로 합니다.</li>
                                    <li>2. 등록 내용에 허위, 기재누락, 오기가 있는 경우</li>
                                    <li>3. 기타 회원으로 등록하는 것이 호밍의 기술상 현저히 지장이 있다고 판단되는 경우</li>
                                    <li>③ 회원가입계약의 성립시기는 호밍의 승낙이 가입신청자에게 도달한 시점으로 합니다.</li>
                                    <li>④ 회원은 제1항의 회원정보 기재 내용에 변경이 발생한 경우, 즉시 변경사항을 정정하여 기재하여야 합니다.</li>
                                    <li>제4조(서비스의 제공 및 변경)</li>
                                    <li>① 호밍은 이용자에게 아래와 같은 서비스를 제공합니다.</li>
                                    <li>1. 회원을 위한 컨텐츠 서비스</li>
                                    <li>2. 이벤트</li>
                                    <li>3. 기타 호밍이 자체 개발하거나 다른 회사와의 협력계약 등을 통해 회원들에게 제공할 일체의 서비스</li>
                                    <li>② 호밍은 그 변경될 서비스의 내용 및 제공일자를 제7조 제2항에서 정한 방법으로 이용자에게 통지하고, 제1항에 정한 서비스를 변경하여 제공할 수 있습니다.</li>
                                    <li>제5조(서비스의 중단)</li>
                                    <li>① 호밍은 컴퓨터 등 정보통신설비의 보수점검•교체 및 고장, 통신의 두절 등의 사유가 발생한 경우에는 서비스의 제공을 일시적으로 중단할 수 있고, 새로운 서비스로의 교체 기타 호밍이 적절하다고 판단하는 사유에 기하여 현재 제공되는 서비스를 완전히 중단할 수 있습니다.</li>
                                    <li>② 제1항에 의한 서비스 중단의 경우에는 호밍은 제7조 제2항에서 정한 방법으로 이용자에게 통지합니다. 다만, 호밍이 통제할 수 없는 사유로 인한 서비스의 중단(시스템 관리자의 고의, 과실이 없는 디스크 장애, 시스템 다운 등)으로 인하여 사전 통지가 불가능한 경우에는 그러하지 아니합니다.</li>
                                    <li>제6조(이용자 탈퇴 및 자격 상실 등)</li>
                                    <li>① 이용자는 호밍에 언제든지 자신의 회원 등록을 말소해 줄 것(이용자 탈퇴)을 요청할 수 있으며 호밍은 위 요청을 받은 즉시 해당 이용자의 회원 등록 말소를 위한 절차를 밟습니다.</li>
                                </ul>
                            </div>
        
                        </div>
                        <div class="agree">
                            <h3 class="blind">개인정보 수집 및 이용 동의(필수)</h3>
                            <div class="check">
                                <input type="checkbox" name="agreeCheck2" id="agreeCheck2">
                                <label for="agreeCheck2">개인정보 수집 및 이용 동의(필수)</label>
                            </div>
                            <div class="desc">
                                <ul>
                                    <li>'호밍'은 (이하 '회사'라 함)은 정보통신망 이용촉진 및 정보보호 등에 관한 법률, 개인정보보호법 등 준수하여야 할 관련 법령상의 개인정보보호 규정을 준수하며, 관련 법령에 의거한 개인정보취급방침을 정하여 이를 준수하며 이용자의 권익을 보호하고 개인정보와 관련한 고객의 고충을 원활하게 처리할 수 있도록 최선을 다하고 있습니다.회사는 개인정보취급방침을 통하여 고객님께서 제공하시는 개인정보가 어떠한 용도와 방식으로 이용되고 있으며, 개인정보보호를 위해 어떠한 조치가 취해지고 있는지 알려드립니다. 회사는 개인정보취급방침을 개정하는 경우 웹사이트 팝업공지 (또는 개별공지)을 통하여 공지할 것입니다.</li>
                                    <li>1. 수집하는 개인정보의 항목 및 수집방법</li>
                                    <li>1) 수집하는 개인정보의 항목</li>
                                    <li>회사는 회원가입, 원활한 고객상담, 각종 서비스의 제공을 위해 최초 회원가입 당시 아래와 같은 최소한의 개인정보를 필수항목으로 수집하고 있습니다.</li>
                                    <li>- 필수항목: 이름, 실명 인증값, 휴대전화번호, 이메일</li>
                                    <li>2) 개인정보 수집방법</li>
                                    <li>회사는 다음과 같은 방법으로 개인정보를 수집합니다.</li>
                                    <li>- 홈페이지, 서면양식, 팩스, 전화, 상담 게시판, 이메일, 이벤트 응모, 배송요청</li>
                                    <li>- 협력회사로부터의 제공</li>
                                    <li>- 생성정보 수집 툴을 통한 수집</li>
                                    <li>2. 개인정보의 수집 및 이용 목적</li>
                                    <li>호밍(이하 '회사')는 다음과 같은 목적을 위하여 필요한 최소한의 범위 내에서 아래와 같이 고객님의 개인정보를 수집 및 처리하고 있습니다. 수집한 개인정보는 다음 목적이외의 용도로는 사용되지 않으며 처리 수집 및 이용 목적이 변경되는 경우, 고객님께 변경 내용을 알리고 사전에 동의를 구하겠습니다.</li>
                                    <li>1) 서비스 제공에 관한 계약 이행</li>
                                    <li>컨텐츠 제공, 물품배송, 본인인증</li>
                                    <li>2) 회원관리</li>
                                    <li>회원제 서비스 이용에 따른 본인확인, 개인 식별, 불량회원의 부정 이용 방지와 비인가 사용 방지, 가입 의사 확인, 연령확인, 분쟁 조정을 위한 기록보존, 불만처리 등 민원처리, 고지사항 전달, 회원탈퇴 의사의 확인</li>
                                    <li>3) 신규 서비스 개발 및 마케팅 및 광고에 활용</li>
                                    <li>신규 서비스(제품) 개발 및 특화, 이벤트 등 광고성 정보 전달, 인구통계학적 특성에 따른 서비스 제공 및 광고 게재, 접속 빈도 파악 또는 회원의 서비스 이용에 대한 통계</li>
                                    <li>4) 이벤트 진행 및 경품발송</li>
                                    <li>이벤트/쿠폰 등 광고성 정보 전달, 각종 이벤트 참여시 이벤트 효과 분석 및 이벤트 사후 관리(당첨자 확인/상품 발송), 설문 결과에 대한 통계 분석 및 모니터 활동</li>
                                    <li>3. 개인정보의 보유 및 이용기간</li>
                                    <li>이용자의 개인정보는 원칙적으로 개인정보의 수집 및 이용목적이 달성되면 지체 없이 파기하며 회원 탈퇴시 회원정보는 즉시 삭제되고 회원제 서비스의 정보도 삭제됩니다. 단, 다음의 정보에 대해서는 아래의 이유로 명시한 기간 동안 보존합니다.</li>
                                </ul>
                            </div>
                        </div>
                        <div class="agree">
                            <h3 class="blind">마케팅 정보 수신 및 활용 동의(선택)</h3>
                            <div class="check">
                                <input type="checkbox" name="agreeCheck3" id="agreeCheck3">
                                <label for="agreeCheck3">마케팅 정보 수신 및 활용 동의(선택)</label>
                            </div>
                            <div class="desc">
                                <ul>
                                    <li>호밍은 개인정보보호법 및 정보통신망이용촉진 및 정보보호등에관한법률 등 관계법령에 따라 광고성정보를 전송하기 위해 수신자의 사전 수신동의를 받고 있으며, 광고성정보 수신자의 수신동의여부를 정기적으로 확인합니다.</li>
                                    <li>- 개인정보 이용 상세내용</li>
                                    <li>이용하는 개인정보 : 휴대전화번호,이메일 주소, 쿠키정보</li>
                                    <li>보유 이용 목적 : 혜택 정보,각종 이벤트 정보 등 광고성 정보 제공</li>
                                    <li>보유기간 : 회원탈퇴 후 5일까지</li>
                                    <li>- 제공받는자 : 호밍</li>
                                    <li>- 목적 : 마케팅 활용(새로운 서비스, 신제품, 이벤트, 맞춤형 광고) SMS, 이메일 수신 동의</li>
                                    <li>(핸드폰 문자메시지(SMS), Email 등을 통해 전달될 수 있습니다.)</li>
                                    <li>- 전송내용</li>
                                    <li>발송되는 마케팅 정보는 수신자에게 호밍과 관련하여 제공하는 혜택(포인트, 쿠폰 등) 정보, 각종 이벤트 정보 등 광고성 정보로 관련 법의 규정을 준수하여 발송됩니다. 단, 광고성 정보 이외 의무적으로 안내되어야 하는 정보성 내용은 수신동의 여부와 무관하게 제공됩니다.</li>
                                    <li>- 철회안내</li>
                                    <li>고객님은 수신 동의 이후에라도 의사에 따라 동의를 철회할 수 있으며, 수신을 동의하지 않아도 회사가 제공하는 기본적인 서비스를 이용할 수 있으나, 당사의 마케팅 정보를 수신하지 못할 수 있습니다.</li>
                                    <li>- 수신동의 변경</li>
                                    <li>호밍 이벤트 홈페이지 마이페이지를 통해 수신동의를 변경(동의/철회)할 수 있습니다.</li>
                                </ul>
                            </div>
                        </div>
                        <h4>회원가입 및 사이트 이용을 위해 회원가입 동의가 필요합니다.</h4>
                        <button class="btn" type="sibmit">동의 완료</button>
                    </fieldset>
                </form>
            </div>
        </section>
 
    </main>
    <!-- //main -->

    <?php include "../include/footer.php" ?>
    <!-- //footer -->

    <script src="https://ajax.googleapis.com/ajax/libs/jquery/3.6.0/jquery.min.js"></script>
    <script>
        function joinChecks(){
            // 이용약관 동의 체크
            let agreeCheck1 = $("#agreeCheck1").is(":checked");
            if(agreeCheck1 == false){
                alert("이용약관 동의를 체크해주세요");
                return false;
            }

            // 개인정보 수집 및 이용동의 체크
            let agreeCheck2 = $("#agreeCheck2").is(":checked");
            if(agreeCheck2 == false){
                alert("개인정보 수집 및 이용동의를 체크해주세요");
                return false;
            }
        }
    </script>

</body>
</html>